Revit 2027 API
ElementRecord.IsCurveDriven Method
 Identifies if the element is curve driven.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCurveDriven()
Public Function IsCurveDriven As Boolean
public:
bool IsCurveDriven()
member IsCurveDriven : unit -> bool
Return Value
Boolean
 True if the element is curve driven.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace